//=====================================================================
//
// collision.cppのヘッダファイル [collision.h]
// Author : Kaito Iwasaki
// 
//=====================================================================
#ifndef _collision_H_
#define _collision_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define COLLISION_NONE		(0x00)		// 衝突判定（なし）
#define COLLISION_FRONT		(0x01)		// 衝突判定（前）
#define COLLISION_BACK		(0x02)		// 衝突判定（後ろ）
#define COLLISION_LEFT		(0x04)		// 衝突判定（左）
#define COLLISION_RIGHT		(0x08)		// 衝突判定（右）
#define COLLISION_UP		(0x10)		// 衝突判定（上）
#define COLLISION_DOWN		(0x20)		// 衝突判定（下）

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************

//=====================================================================
// 衝突判定処理（点と立方体）
// 点posAがposBとsizeBで作られる立方体の内にあるか判定します。
//=====================================================================
bool CollisionPointBox(D3DXVECTOR3 posA, D3DXVECTOR3 posB, D3DXVECTOR3 sizeB);

//=====================================================================
// 衝突判定処理（点と立方体）
// 点posAがposBとboxMin、boxMaxで作られる立方体の内にあるか判定します。
//=====================================================================
bool CollisionPointBox(D3DXVECTOR3 posA, D3DXVECTOR3 posB, D3DXVECTOR3 boxMin, D3DXVECTOR3 boxMax);

//=====================================================================
// 衝突判定処理（点と立方体）
// 点posAがposBとsizeBで作られる立方体の内にあるか判定します。
// 衝突判定があった場合にはBYTE型で衝突方向を返します。
// 衝突判定がなかった場合にはCOLLSION_NONE(0x00)を返します。
//=====================================================================
BYTE CollisionPointBoxDirection(D3DXVECTOR3 posA, D3DXVECTOR3 posAOld, D3DXVECTOR3 posB, D3DXVECTOR3 sizeB);

//=====================================================================
// 衝突判定処理（点と立方体）
// 点posAがposBとboxMin、boxMaxで作られる立方体の内にあるか判定します。
// 衝突判定があった場合にはBYTE型で衝突方向を返します。
// 衝突判定がなかった場合にはCOLLSION_NONE(0x00)を返します。
//=====================================================================
BYTE CollisionPointBoxDirection(D3DXVECTOR3 posA, D3DXVECTOR3 posAOld, D3DXVECTOR3 posB, D3DXVECTOR3 boxMin, D3DXVECTOR3 boxMax);

//=====================================================================
// オブジェクトの当たり判定処理（点と立方体）
// プレイヤーがオブジェクトの範囲内
// & オブジェクトののMax.Yより上にある場合その座標を返します。
//=====================================================================
float CollisionPointBoxObject(D3DXVECTOR3 pPlayerPos, D3DXVECTOR3 pObjectPos, D3DXVECTOR3 vtxMin, D3DXVECTOR3 vtxMax, float fStandPos);

#endif