//=======================================================
//
// タイトルロゴの描画処理[shadow.h]
// Author : Keitaro Nagate
//
//=======================================================
#ifndef _TEAMLOGO__H_
#define _TEAMLOGO__H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
//*********************************************************************
// シーン列挙型
//*********************************************************************
typedef enum
{
	GAMEOVER_RETRY = 0,
	GAMEOVER_QUIT,
	GAMEOVER_BLOOD1,
	GAMEOVER_BLOOD2,
	GAMEOVER_GAMEOVER,
	GAMEOVER_TIMER1,
	GAMEOVER_TIMER2,
	GAMEOVER_MAX,
	
}GAMEOVER;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			//ロゴの位置
	D3DXCOLOR col;				//ロゴの色
	GAMEOVER type;				//チームロゴのタイプ
	bool bUse;					//どこを選択しているか
	int Timer;					//タイマー
	int Fream;					//フレーム
}TeamLogo;
//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitGameover(void);
void UninitGameover(void);
void UpdateGameover(void);
void DrawGameover(void);

#endif
