//==================================================
//
// リフト[lift.h]
// Author : Keitaro Nagate
//
//==================================================
#ifndef _LIFT_H_
#define _LIFT_H_

//==================================================
//
//	ファイルインクルード
//
//==================================================
#include "main.h"

//==================================================
//
//	構造体定義
//
//==================================================
#define MAX_TEXTURE		(8)	//テクスチャの最大数

//==================================================
//
//	列挙型
//
//==================================================

//==================================================
//
//	構造体定義
//
//==================================================
typedef struct
{
	D3DXVECTOR3 pos;			// 位置
	D3DXVECTOR3 rot;			// 角度
	D3DXVECTOR3 MotionRange;	// 可動域
	bool bChatch;				// 掴まれているか
	bool bUse;					// 使用 /不使用
	D3DXVECTOR3 SavePos;		// 初期配置
	D3DXMATRIX mtxWorld;
}Lift;

//==================================================
//
//	プロトタイプ宣言
//
//==================================================
void InitLift(void);
void UninitLift(void);
void UpdateLift(void);
void DrawLift(void);
void SetLift(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 range);
bool CollisionLift(void);

#endif // !_STAGELIGHT_H_

