//==================================================
//
// ライト（太陽光）[light.h]
// Author : Keitaro Nagate
//
//==================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

//==================================================
//
//	ファイルインクルード
//
//==================================================
#include "main.h"

//==================================================
//
//	マクロ定義
//
//==================================================

//==================================================
//
//	プロトタイプ宣言
//
//==================================================
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);
void SetLight(int Number, D3DXVECTOR3 vec, D3DXCOLOR col);
void SetSpotLight(int nIdx, D3DXVECTOR3 pos, D3DXCOLOR col);

#endif // !_LIGHT_H_

