//=====================================================================
//
// particle.cppのヘッダファイル [particle.h]
// Author : 
// 
//=====================================================================
#ifndef _PARTICLE_H_
#define _PARTICLE_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************
typedef enum
{
	PARTICLETYPE_BALL = 0,				//ボール型
	PARTICLETYPE_FIRE,
	PARTICLETYPE_FOG,					//霧
	PARTICLETYPE_MAX,
}PARTICLETYPE;

//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	D3DXVECTOR3 pos;				//パーティクルの位置
	D3DXVECTOR3 move;				//パーティクルの移動量
	D3DXVECTOR3 size;				//パーティクルのサイズ
	D3DXCOLOR col;					//パーティクルの色
	int nLife;						//パーティクルの寿命
	bool bUse;						//パーティクルを使用しているかどうか
	PARTICLETYPE nTyoe;				//パーティクルの種類
	int nFream;
	
}Particle;



//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitParticle(void);
void UninitParticle(void);
void UpdateParticle(void);
void DrawParticle(void);
void SetParticle(D3DXVECTOR3 pos, D3DXCOLOR col , D3DXVECTOR3 move , int nLife , D3DXVECTOR3 size , PARTICLETYPE nType);

#endif