//==================================================
//
// プレス機[press.h]
//
//==================================================
#ifndef _PRESS_H_
#define _PRESS_H_

//==================================================
//
//	ファイルインクルード
//
//==================================================
#include "main.h"

//==================================================
//
//	マクロ定義
//
//==================================================
#define MAX_TEXTURE_PRESS		(8)	//テクスチャの最大数

//==================================================
//
//	構造体定義
//
//==================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 rot;	//角度
	bool bStartup;		//起動のON/OFF
	bool bUse;			// 使用 / 不使用
	D3DXMATRIX mtxWorld;

	float fInterval;	//動きの間隔
}Press;


//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitPress(void);
void UninitPress(void);
void UpdatePress(void);
void DrawPress(void);
void SetPress(D3DXVECTOR3 pos, D3DXVECTOR3 rot, bool Interval);

#endif