//==================================================
//
// ギミックの距離からSEを調整[SE_controller.h]
// Author : Keitaro Nagate
//
//==================================================
#ifndef _SE_CONTROLLER_H_
#define _SE_CONTROLLER_H_

//==================================================
//
//	ファイルインクルード
//
//==================================================
#include "main.h"
#include "sound.h"

//==================================================
//
//	マクロ定義
//
//==================================================

//==================================================
//
//	列挙型
//
//==================================================

//==================================================
//
//	構造体定義
//
//==================================================
typedef struct
{
	int nIdx;
	D3DXVECTOR3 pos;		// 音の発生地点
	SOUND_LABEL Sound;		// サウンドの種類
	float fVolume;			// 音量
	bool bwithin;			// 音の範囲内か
	bool bUse;				// 使用/不使用
}SoundSpot;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitSEController(void);
void UpdateSEController(void);
int SetSoundSpot(D3DXVECTOR3 pos, SOUND_LABEL label);

#endif