//=====================================================================
//
// timer.cppのヘッダファイル [timer.h]
// Author : 
// 
//=====================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define INIT_TIMER		(300)
#define FRAME_TIMER		(60)		//時間が減るフレーム数
#define MAX_TIMER		(3)			//表示される時間の数
#define TIMER_SET_MAX   (3)			// タイマーの個数

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	D3DXVECTOR3 pos;			//タイマーの位置
	D3DXCOLOR col;				//タイマーの色
	int Fream;				//タイマーのフレーム
	int CountTimer;				//タイマーが1秒減る
	D3DXMATRIX mtxWorld;		// ワールドマトリックス
	bool bUse;					//使用されているかどうか
	bool bTimer;				//時間設定したかどうか
	int nTexType;
}Timer;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);
void SetTimer(int nTexType, D3DXVECTOR3 pos ,D3DXCOLOR col );
void AddTimer(int nValue);
void DownTimer(int nDown);
void SetTimerCount(int nTimer);
int GetTimer (void);
#endif