//=====================================================================
//
// timer.cppのヘッダファイル [timer.h]
// Author : 
// 
//=====================================================================
#ifndef _TIMER_H_
#define _TIMER_H_

//*********************************************************************
// 
// ***** インクルードファイル *****
// 
//*********************************************************************
#include "main.h"

//*********************************************************************
// 
// ***** マクロ定義 *****
// 
//*********************************************************************
#define INIT_TIMER		(300)
#define FRAME_TIMER		(60)		//時間が減るフレーム数
#define TIMER_SET_MAX   (128)			// タイマーの個数
#define MAX_PLACE		(3)			//表示される時間の数

//*********************************************************************
// 
// ***** 列挙型 *****
// 
//*********************************************************************


//*********************************************************************
// 
// ***** 構造体 *****
// 
//*********************************************************************
typedef struct
{
	D3DXMATRIX mtxWorld;
	D3DXVECTOR3 pos;			//タイマーの位置
	D3DXVECTOR2 size;
	D3DXCOLOR col;				//タイマーの色
	int bUse;
	int aPlace[MAX_PLACE];
}Timer;

//*********************************************************************
// 
// ***** プロトタイプ宣言 *****
// 
//*********************************************************************
void InitTimer(void);
void UninitTimer(void);
void UpdateTimer(void);
void DrawTimer(void);
void SetTimer(D3DXVECTOR3 pos, D3DXVECTOR2 size);
void AddTimer(int nValue);
void DownTimer(int nDown);
void SetTimerCount(int nTimer);
int GetTimer (void);
#endif